{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "nB" : 20,
      "top" : "sequential_4\/dense_20\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 64,
      "blob_weights" : 3,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "dense_20_input",
      "blob_biases" : 1,
      "has_tanh" : 0,
      "debug_info" : "sequential_4\/dense_20\/BiasAdd",
      "name" : "sequential_4\/dense_20\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 64,
      "top" : "sequential_4\/dense_21\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 32,
      "blob_weights" : 7,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "sequential_4\/dense_20\/Relu",
      "blob_biases" : 5,
      "has_tanh" : 0,
      "debug_info" : "sequential_4\/dense_21\/BiasAdd",
      "name" : "sequential_4\/dense_21\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 32,
      "top" : "sequential_4\/dense_22\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 16,
      "blob_weights" : 11,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "sequential_4\/dense_21\/Relu",
      "blob_biases" : 9,
      "has_tanh" : 0,
      "debug_info" : "sequential_4\/dense_22\/BiasAdd",
      "name" : "sequential_4\/dense_22\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "nB" : 16,
      "top" : "sequential_4\/dense_23\/Relu",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 8,
      "blob_weights" : 15,
      "type" : "inner_product",
      "has_relu" : 1,
      "bottom" : "sequential_4\/dense_22\/Relu",
      "blob_biases" : 13,
      "has_tanh" : 0,
      "debug_info" : "sequential_4\/dense_23\/BiasAdd",
      "name" : "sequential_4\/dense_23\/BiasAdd",
      "has_prelu" : 0
    },
    {
      "has_prelu" : 0,
      "top" : "Identity",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 1,
      "blob_weights" : 19,
      "type" : "inner_product",
      "has_relu" : 0,
      "attributes" : {
        "is_output" : 1
      },
      "bottom" : "sequential_4\/dense_23\/Relu",
      "debug_info" : "Identity",
      "has_tanh" : 0,
      "blob_biases" : 17,
      "name" : "Identity",
      "nB" : 8
    }
  ]
}